<?php
$lang = array();
$lang["temperature"] = "درجه حرارت: ";
$lang["temperatureText"] = "مقدار دما معیاری برای اصالت است. مقدار دما تعیین می کند که یک مدل زبان چقدر پاسخ های تصادفی تولید می کند. یک مقدار دمای بالا امکان پاسخ‌های خلاقانه‌تر و متنوع‌تر را فراهم می‌کند، اما یک مقدار دمای پایین، پاسخ‌های دقیق‌تر و معنادارتر را ممکن می‌سازد. تنظیم این مقدار بسته به کاربرد مورد نظر می تواند متفاوت باشد. به عنوان مثال، اگر از یک مدل زبان به عنوان تولید کننده بازی استفاده می کنید، مقدار دمای بالا ممکن است به شما کمک کند بازی های سرگرم کننده و متنوع تری ایجاد کنید. با این حال، اگر از یک مدل زبان به عنوان منبع خبری استفاده می کنید، مقدار دمای پایین ممکن است اخبار دقیق و قابل اعتمادتری ارائه دهد. پیشنهادی: 0.6";
$lang["maxTokens"] = "حداکثر توکن ها: ";
$lang["maxTokensText"] = "هدف max_tokens تعیین حداکثر تعداد توکن هایی است که در یک تماس برگردانده می شوند. یک نشانه را می توان به عنوان شکل تقسیم شده یک زبان در سیستم های پردازش زبان تعریف کرد. به عنوان مثال، می توان از آن برای تجزیه یک جمله به کلمات استفاده کرد. تنظیمات max_tokens را می توان برای کنترل طول پاسخ های برگردانده شده توسط GPT-API استفاده کرد. اگر هیچ تنظیم max_tokens در تماس مشخص نشده باشد، پیش‌فرض این است که 256 توکن را برگرداند..";
$lang["saveSettings"] = "تنظیمات را ذخیره کن";
$lang["chatGptText"] = "متنی که باید برای Chat GPT درخواست شود:";
$lang["testButton"] = "نمایش پاسخ";
$lang["blogTitle"] = "عنوان پست وبلاگ:";
$lang["blogContent"] = "محتوای پست وبلاگ: (در خروجی که مشاهده می کنید نمایش داده می شود.)";
$lang["blogContentDesc"] = "پاسخ Chat GPT در اینجا نمایش داده می شود، می توانید قبل از افزودن آن به عنوان یک پست وبلاگ، آن را ویرایش کنید.";
$lang["blogCategory"] = "دسته بندی پست وبلاگ:";
$lang["blogKeywords"] = "کلمات کلیدی پست وبلاگ: (باید با کاما از هم جدا شوند):";
$lang["addBlogButton"] = "اضافه کردن پست وبلاگ";
$lang["selectLanguage"] = "زبان را انتخاب کنید:";
?>
